<template>

    <div id="ct_item">
        <el-row class="ct_item_pl" type="flex" justify="space-between" style="height: 50px;margin-top: 10px">
            <el-col :span="6" style="min-width: 200px">
                <el-avatar style="vertical-align: middle;margin-right: 10px" shape="circle" size="large" :src="circleUrl"></el-avatar>
                <span style="min-width: 100px;overflow:hidden;
                    text-overflow: ellipsis;
                    white-space: nowrap;">漂亮的小老鼠</span>
            </el-col>
            <el-col :span="6" style="display: flex;align-items: center;justify-content: center;font-size: 14px;min-width: 150px">
                2020-01-12 12:30:12
            </el-col>
        </el-row>
        <el-row  class="ct_item_pl" style="border-top: #cccccc solid 1px;padding: 5px 0">
            <p class="ct_item_p">
                噫吁嚱，危乎高哉！蜀道之难，难于上青天！蚕丛及鱼凫，开国何茫然！尔来四万八千岁，不与秦塞通人烟。西当太白有鸟道，可以横绝峨眉巅。地崩山摧壮士死，然后天梯石栈相钩连。
                上有六龙回日之高标，下有冲波逆折之回川。
                黄鹤之飞尚不得过，猿猱欲度愁攀援。
            </p>
            <p class="ct_item_p cy_item_p_aside">
                噫吁嚱，危乎高哉！蜀道之难，难于上青天！蚕丛及鱼凫，开国何茫然！尔来四万八千岁，不与秦塞通人烟。西当太白有鸟道，可以横绝峨眉巅。地崩山摧壮士死，然后天梯石栈相钩连。
                上有六龙回日之高标，下有冲波逆折之回川。
                黄鹤之飞尚不得过，猿猱欲度愁攀援。
            </p>
        </el-row>
        <el-row  class="ct_item_pl" style="margin-top: 5px">
            <span>
                <svg viewBox="0 0 1024 1024"
                     width="1rem" style="vertical-align: middle" height="1rem">
                    <path d="M621.674667 408.021333c16.618667-74.24 28.224-127.936 34.837333-161.194666C673.152 163.093333 629.941333 85.333333
                    544.298667 85.333333c-77.226667 0-116.010667 38.378667-138.88 115.093334l-0.586667 2.24c-13.728 62.058667-34.72
                    110.165333-62.506667 144.586666a158.261333 158.261333 0 0 1-119.733333 58.965334l-21.909333 0.469333C148.437333
                    407.808 106.666667 450.816 106.666667 503.498667V821.333333c0 64.8 52.106667 117.333333 116.394666
                    117.333334h412.522667c84.736 0 160.373333-53.568
                    189.12-133.92l85.696-239.584c21.802667-60.96-9.536-128.202667-70.005333-150.186667a115.552 115.552 0 0
                    0-39.488-6.954667H621.674667zM544.256 149.333333c39.253333 0 59.498667 36.48 49.888 84.928-7.573333 38.144-21.984
                    104.426667-43.221333 198.666667-4.512 20.021333 10.56 39.093333 30.912 39.093333h218.666666c6.101333 0 12.16 1.066667
                    17.909334 3.168 27.445333 9.984 41.674667 40.554667 31.776 68.266667l-85.568 239.573333C744.981333 838.026667 693.301333
                    874.666667 635.402667 874.666667H223.498667C194.314667 874.666667 170.666667 850.784
                    170.666667 821.333333V503.498667c0-17.866667 14.144-32.448 31.829333-32.821334l21.866667-0.469333a221.12 221.12 0 0 0
                    167.381333-82.56c34.346667-42.602667 59.146667-99.306667 74.869333-169.877333C482.101333 166.336 499.552 149.333333
                    544.266667 149.333333z" fill="#8a8a8a"></path>
                </svg>
                <span class="spanSpace">12</span>
            </span>
            <span style="margin-left: 20px">
                <svg viewBox="0 0 1024 1024" width="1rem" style="vertical-align: middle" height="1rem">
                    <path d="M870.03648 174.45888l20.70528 416.6656-65.65888 0.29184-1.73568-416.7168
                    46.68928-0.24064m9.69728-71.35232h-0.31232l-66.60608 0.33792c-33.73056
                    0.16896-60.94336 27.63776-60.80512 61.36832l1.8176 437.08416c0.13824 33.66912 27.4688 60.86144 61.1072
                    60.86144h0.27648l86.5024-0.384c34.83648-0.1536 62.49472-29.35296
                    60.76928-64.14848l-21.71904-437.03808c-1.61792-32.54784-28.47744-58.08128-61.0304-58.08128zM637.57312
                    174.16192l2.03776 452.38784-116.8384 158.85312 1.3056-91.85792a111.22688 111.22688 0 0
                    0-32.24576-80.25088c-21.2224-21.52448-49.55648-33.3824-79.77984-33.3824H411.648l-248.32512 0.89088c-12.42624
                    0-20.02432-6.87616-23.4496-10.97728-3.42016-4.096-8.82688-12.8-6.6048-25.04192L200.192
                    176.26624l437.38112-2.10432m10.14272-71.3472h-0.30208l-456.03328 2.2016a61.12256 61.12256 0 0 0-59.83744
                    50.19136l-68.43392 376.84224c-11.36128 62.5408 36.70016 120.05888 100.20352 120.05888h0.37888l248.20224-0.89088h0.14848a40.74496 40.74496 0 0 1 40.73472 41.3184l-2.65728 187.24352c-0.3584 25.3184 20.16768 41.40544 41.1648 41.40544 11.8784 0 23.9104-5.15072 32.39424-16.68608l179.34848-243.84512a40.73984 40.73984 0 0 0 7.92064-24.32512l-2.12992-472.6784c-0.14336-33.65888-27.47392-60.84096-61.10208-60.83584z" fill="#8a8a8a" p-id="4336"></path></svg>
                <span class="spanSpace">12</span>
            </span>
            <span style="margin-left: 20px">
                <i class="el-icon-chat-dot-round"></i>
                <span class="cursorPoint">回复</span>
            </span>
            <span style="margin-left: 20px" class="cursorPoint">
                <svg viewBox="0 0 1024 1024"
                     width="1rem" style="vertical-align: middle" height="1rem">
                    <path d="M512 358.555826c-12.288 0-22.26087 9.97287-22.26087 22.26087l0 268.221217c0 12.288 9.97287 22.26087 22.26087
                    22.26087s22.26087-9.97287 22.26087-22.26087L534.26087 380.816696C534.26087 368.528696 524.288 358.555826 512 358.555826zM512
                    716.176696c-12.288 0-22.26087 9.97287-22.26087 22.26087l0 44.699826c0 12.288 9.97287 22.26087 22.26087
                    22.26087s22.26087-9.97287
                    22.26087-22.26087l0-44.699826C534.26087 726.149565 524.288 716.176696 512 716.176696zM998.912 867.394783 575.688348
                    131.33913C559.972174
                    104.025043 536.754087 88.33113 512 88.33113S464.027826 104.025043 448.311652 131.33913L25.088 867.394783c-8.859826
                    15.426783-13.356522
                    30.675478-13.356522 45.345391 0 32.456348 23.908174 65.224348 77.312 65.224348l845.913043 0c53.381565 0 77.289739-32.768
                    77.312-65.224348C1012.268522 898.070261 1007.771826 882.821565 998.912 867.394783zM934.956522 933.420522 89.043478
                    933.420522c-9.861565
                    0-32.790261-2.025739-32.790261-20.702609 0-6.678261 2.56-14.669913 7.41287-23.129043L486.912
                    153.533217c15.137391-26.290087 35.06087-26.290087
                    50.198261 0l423.223652 736.033391c4.85287 8.45913 7.41287 16.450783 7.41287 23.129043C967.746783
                    931.394783 944.818087 933.420522 934.956522
                    933.420522z" fill="#8a8a8a"></path>
                </svg>
                <span @click="report" class="cursorPoint">举报</span>
            </span>
        </el-row>
    </div>

</template>
<script>
export default {
    name: "CommentItem",
    data(){
        return{
            circleUrl: "https://cube.elemecdn.com/3/7c/3ea6beec64369c2642b92c6726f1epng.png",
        }
    },
    methods: {
        report(){
            alert("java");
        }
    }
}
</script>
<style scoped>

.ct_item_p{
    text-indent: 2rem;
    margin-top: 5px
}

.cy_item_p_aside{
    display: inline-block;
    border-left: #5cae97 solid 5px;
    margin: 10px 0;
    opacity: .5;
    padding-left: 5px;
}

#ct_item{
    border-top: #f8d0ab solid 5px;
    width: 100%;
    margin-bottom: 30px;
    border-right: #cccccc solid 1px;
    border-left: #cccccc solid 1px;
    border-bottom: #cccccc solid 1px;
    padding-bottom: 15px;
}
.cursorPoint{
    font-size: 14px;
    margin-left: 3px;
}

.cursorPoint:hover{
    cursor: pointer;
    opacity: .5;
    transition: .4s;
}

.spanSpace{
    font-size: 14px;
    margin-left: 3px;
}

svg:hover{
    cursor: pointer;
}

.ct_item_pl{
    margin: 0 25px;
}

</style>
